---
type: FamilyInstanceCreationData
namespace: Autodesk.Revit.Creation
version: 2024
members: 3
tags: [revit-api, class]
---

# FamilyInstanceCreationData

`Autodesk.Revit.Creation.FamilyInstanceCreationData` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilyInstanceCreationData | — | `` |
| Property | Axis | — | `public Line Axis { get ; set ; }` |
| Property | RotateAngle | — | `public double RotateAngle { get ; set ; }` |